In [8]:
import numpy as np
import pandas as pd

In [9]:
reserve_tb = pd.read_csv('reserve.csv')

In [15]:
rsv_cnt_tb = reserve_tb.groupby('hotel_id').size().reset_index()
rsv_cnt_tb.columns = ['hotel_id', 'reserve_cnt']
rsv_cnt_tb.head()

  hotel_id  reserve_cnt
0      h_1           10
1     h_10            3
2    h_100           20
3    h_101           17
4    h_102           13

In [16]:
cus_cnt_tb = reserve_tb.groupby('hotel_id')['customer_id'].nunique().reset_index()
cus_cnt_tb.columns = ['hotel_id', 'cus_cnt']
cus_cnt_tb.head()

  hotel_id  cus_cnt
0      h_1       10
1     h_10        3
2    h_100       19
3    h_101       17
4    h_102       13

In [17]:
result = reserve_tb.groupby('hotel_id').agg({'reserve_id': 'count', 'customer_id': 'nunique'}).reset_index()
result.columns = ['hotel_id', 'rsv_cnt', 'cus_cnt']
result.head()

  hotel_id  rsv_cnt  cus_cnt
0      h_1       10       10
1     h_10        3        3
2    h_100       20       19
3    h_101       17       17
4    h_102       13       13

In [18]:
result = reserve_tb.groupby(['hotel_id', 'people_num'])['total_price'].sum().reset_index()
result = result.rename(columns={'total_price': 'price_sum'})
result.head()

  hotel_id  people_num  price_sum
0      h_1           1     156600
1      h_1           2     156600
2      h_1           3     391500
3      h_1           4     417600
4     h_10           1      11200